# make/Makefile.lint.mk
# 代码检查模块

# Help 信息
define HELP_LINT
	@echo "代码检查相关："
	@echo "  make fmt            - 格式化代码"
	@echo "  make lint           - 代码检查"
	@echo ""
endef

# ============================================
# 代码格式化
# ============================================

# 格式化代码
fmt:
	@echo "格式化代码..."
	@go fmt ./...
	@gofmt -s -w .
	@echo "✓ 代码格式化完成"

# ============================================
# 代码检查
# ============================================

# 代码检查
lint:
	@echo "代码检查..."
	@golangci-lint run
	@echo "✓ 代码检查完成"
